views/calculator_service_wsdl.erb

<?xml version="1.0"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.hans.com/calculator_service" xmlns:calculator="http://www.hans.com/calculator" targetNamespace="http://www.hans.com/calculator_service">
  <wsdl:types>
    <xs:schema xmlns="http://www.hans.com/calculator" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://www.hans.com/calculator" attributeFormDefault="qualified" elementFormDefault="qualified">
      <xs:include schemaLocation="../calculator_service.xsd"/>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="CarPremiumRequestMessage">
    <wsdl:part name="parameter" element="calculator:CarPremiumRequest"/>
  </wsdl:message>
  <wsdl:message name="CarPremiumResponseMessage">
    <wsdl:part name="parameter" element="calculator:CarPremiumResponse"/>
  </wsdl:message>
  <wsdl:message name="LifePremiumRequestMessage">
    <wsdl:part name="parameter" element="calculator:LifePremiumRequest"/>
  </wsdl:message>
  <wsdl:message name="LifePremiumResponseMessage">
    <wsdl:part name="parameter" element="calculator:LifePremiumResponse"/>
  </wsdl:message>
  <wsdl:portType name="CalculatorPortType">
    <wsdl:operation name="CarPremium">
      <wsdl:input message="tns:CarPremiumRequestMessage"/>
      <wsdl:output message="tns:CarPremiumResponseMessage"/>
    </wsdl:operation>
    <wsdl:operation name="LifePremium">
      <wsdl:input message="tns:LifePremiumRequestMessage"/>
      <wsdl:output message="tns:LifePremiumResponseMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="CalculatorBinding" type="tns:CalculatorPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="CarPremium">
      <soap:operation soapAction="http://www.hans.com/calculator_service#CarPremium"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="LifePremium">
      <soap:operation soapAction="http://www.hans.com/calculator_service#LifePremium"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="CalculatorService">
    <wsdl:port name="CalculatorPort" binding="tns:CalculatorBinding">
      <soap:address location="<%= url %>/calculator_service"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
